#gridという２次元配列の、行と列を入れ替えて出力する
grid = [['.','.','.','.','.','.'],
		['.','0','0','.','.','.'],
		['0','0','0','0','.','.'],
		['0','0','0','0','0','.'],
		['.','0','0','0','0','0'],
		['0','0','0','0','0','.'],
		['0','0','0','0','.','.'],
		['.','0','0','.','.','.'],
		['.','.','.','.','.','.'],]
#行数
row = len(grid)
if(row <= 0):
	sys.exit()
#列数
col = len(grid[0])
print('row = ' + str(row) + ', column = ' + str(col))
print('----------')

#列=j、行=iとしてfor文を回す
#内側のforループで行を変えていくことで、元の配列の行列を入れ替える
for j in range(col):
	for i in range(row):
		#行数が最大以外なら改行しない
		if(i < row - 1):
			print(grid[i][j],end='')
		else:
			print(grid[i][j])
